{
    "aura": "Overall vibe, energy, or personality.",
    "basic": "Pertaining to those who prefer mainstream products, trends, and music. Derived from the term \"basic bitch\".",
    "bar(s)": "A lyric in a rap song that is considered excellent.",
    "BDE": "Abbreviation for \"big dick energy\": confidence and ease.",
    "beige flag": "A behavior or personality trait that is neither good nor bad. See red flag.",
    "bestie": "Short for \"best friend\". Sometimes used jokingly for someone the speaker/writer has no relationship with.",
    "bet": "Agreeing to something; yes; okay; sure.",
    "big yikes": "Used to describe something embarrassing or cringe, particularly in response to an offensive comment.",
    "bop": "(1) A derogatory term, usually for females, suggesting excessive flirtatiousness or promiscuity. (2) An exceptionally good song. (3) An acronym for \"baddie on point\", meaning someone who uses their appearance to make money.",
    "brainrot": "The state of losing touch with the real world as a result of consuming hyper-stimulating or chronically online content, especially when characterized by online buzzwords (\"skibidi\", \"fanum tax\", \"rizz\", etc). Derived from the idea that one's brain would \"rot\" from consuming too much stimulating, addictive or degenerate content.",
    "bruh (/brʌ/)": "Used to express shock, embarrassment, or disappointment.",
    "bugging": "See tweaking for more context.",
    "bussin'": "Extremely good, excellent. Originated from African-American vernacular for good food. ",
    "bussy": "Portmanteau of \"boy\" and \"pussy\" (slang for the vagina). Effectively a man's anus. (See also: -ussy)",
    "cap": "To lie. See no cap.",
    "caught in 4K": "Refers to someone being indisputably caught doing something wrong or incriminating on camera or with evidence to prove it, referencing 4K resolution.",
    "clanker": "Slur for robots.",
    "clapback": "Swift and witty response to an insult or critique.",
    "cook": "To \"cook\" is to perform or do well. In contrast, when a person is \"cooked\", they are in trouble.",
    "crash out": "To make a reckless or regrettable decision after a bout of rage or upset. Originated in the African-American community, specifically in Louisiana with usage by rappers like NBA YoungBoy, but became popular on TikTok in 2024.",
    "clock": "To belittle or silence someone, often in a manner that is intended to embarrass or undermine their confidence, similar to \"gag\".",
    "dank": "Excellent, high-quality.",
    "dead/ded": "Humorous to such an extent as to \"kill you\". Laughter and death have been associated since Ancient Greece, where it is held that Zeuxis died from laughing at a portrait of an ugly woman he was painting.",
    "delusionship": "A relationship in which someone holds unrealistic or overly idealistic beliefs. A person who holds such beliefs is considered \"delulu\".",
    "drip": "Trendy high-class fashion.",
    "face card": "An attractive face. Sometimes defined as never declining or receding.",
    "finna": "Short for \"fixing to\". The term has its roots in Southern American English, where \"fixing to\" has been used to mean \"getting ready to\" since the 18th century. Often used interchangeably with \"gonna\".",
    "fire": "Term used to describe that something is impressive, good, or cool. Also see lit. Alternative: flame.",
    "fit/fit check": "Term used to highlight or bring attention to one's outfit. \"Fit\" is a truncation of \"outfit\".",
    "gagged": "Shocked, amazed, or at a loss for words.",
    "gas": "To describe something as highly entertaining, pleasant, or good. See slaps.",
    "ghost": "To end communication or contact with someone without warning.",
    "glaze": "To hype, praise, or compliment someone so much that it becomes annoying or excessive.",
    "glizzy": "A hot dog. Popularized in 2020, possibly from the Washington metropolitan area, and possibly originating from the slang term \"glizzy\" for a Glock handgun (approximately the same length as a hot dog).",
    "glow-up": "A major improvement in one's self, usually an improvement in appearance, confidence, and style. Frequently used in a context relating to puberty. A \"glow-down\" is a situation where someone's appearance has declined.",
    "GOAT": "Acronym for \"greatest of all time\".",
    "green flag": "Behaviors or personality traits that are considered positive, healthy, or desirable. See red flag.",
    "Gucci (/ˈɡuːtʃi/)": "Meaning good, cool, fashionable, or excellent. Used to express approval or satisfaction for something. Originated from the luxury brand Gucci.",
    "gyatt": "Someone with a big buttocks or an hourglass figure.",
    "hb/hg": "An initialism of homeboy/homegirl. Slang used to refer to one's friends.",
    "hit different": "To be better in a distinctive manner. The origin of the term is not clear.",
    "huzz": "A variation of the pejorative word \"hoes\" similarly used to objectify, degrade, and/or belittle women. Originated and became popular on TikTok. The term gained traction with its usage and teaching by streamer Kai Cenat.",
    "ick": "A sudden feeling of disgust or repulsion for someone one was previously attracted to.",
    "icl": "Abbreviation of \"I can't lie\". Often used alongside ts and pmo.",
    "IJBOL (/ˈiːdʒboʊl/)": "An acronym for \"I just burst out laughing\".",
    "I oop": "Used to express shock, embarrassment, and or amusement.",
    "iPad kid": "Derogatory term describing Generation Alpha children who spend most of their time consuming content via phone or tablet screens. The term was popularized in January 2021 after a 21-year-old TikToker criticized Millennial parents for allowing their children excessive screen time, saying, \"I need everyone else in my generation to promise that we are not going to raise 'iPad children'. ... You've been shoving media and screens in these kids' faces since birth.\" He concludes: \"Gen Z isn't allowed to raise iPad kids.\" The viral video garnered more than 525 million views on TikTok.",
    "it's giving": "Used to describe an attitude or connotation.",
    "iykyk": "Acronym for \"If you know, you know\". Used to describe inside jokes.",
    "jit": "A Black American term originating in the 1970s. Often used to describe an inexperienced or young individual.",
    "Karen": "Pejorative term for an obnoxious, angry, or entitled White woman.",
    "L": "Short for \"loss,\" used to indicate failure, defeat, or something negative. Often contrasted with \"W\" (win).",
    "lit": "Remarkable, interesting, fun, or amusing.",
    "locked in": "A state of total concentration on a task. Similar to flow state.",
    "looksmaxxing": "An attempt (often pseudoscientific) to maximize physical attractiveness.",
    "lore": "Backstory.",
    "main character (MC)": "Someone who is or wants to be the star of their life. Often refers to someone who wants to be the center of attention.",
    "mew": "A pseudoscientific method to restructure someone's jawline by pressing their tongue to the roof of their mouth. Coined by controversial British dentist John Mew and his son, Mike, the term became popular in the late 2010s and on TikTok. See looksmaxxing.",
    "mid": "Average, mediocre, not bad or not special. Sometimes used in a negative or insulting way.",
    "mog": "To look significantly more attractive than someone or something, causing them to appear inferior in comparison. Derived from AMOG, or alpha male of the group.",
    "moot(s)": "Short for \"mutuals\" or \"mutual followers\".",
    "Netflix and chill": "To engage in sexual activity, possibly while or after watching a movie or a TV series together.",
    "no cap": "\"This is true\"; \"I'm not lying\". See cap.",
    "OK boomer": "Pejorative directed toward members of the Baby Boomer generation, used to dismiss or mock attitudes typically associated with baby boomers as out of date.",
    "oof": "Used to express discomfort, surprise, dismay, or sympathy for someone else's pain. Until 2022, it was also the expression of a Roblox avatar when it dies or respawns. Thus the verb \"to oof\" can mean killing another player in a game or messing up something oneself.",
    "oomf": "Abbreviation for \"One of My Followers\" or \"One of My Friends\".",
    "opp": "Short for opposition or enemies; describes an individual's opponents. A secondary, older definition has the term be short for \"other peoples' pussy\". Originated from street and gang culture. Dexerto claims that the primary definition stems from the secondary one, which was derived from a 1991 Naughty by Nature song titled \"O.P.P.\". The initialism was derived from the acronym \"OPM\", which was used in the neighborhood the group grew up in and stood for \"other people's money\". An example of the term being used in popular culture is also in the Gangsta rap scene, with YBN Nahmir and his song \"Opp Stoppa\". Dictionary.com implies that the origins for the two meanings had little to do with each other.",
    "out of pocket": "To act (or say something) crazy, wild, or extreme, sometimes to an extent that is considered too far.",
    "owned": "Used to refer to defeat in a video game, or domination of an opposition. Also less commonly used to describe defeat in sports. Originated in the 1990s as a term used to describe hackers gaining administrative control over another person's computer.",
    "periodt": "Used as an interjection to indicate that the preceding statement is final and that there is nothing more to be said about it; similar to the British term \"full stop\". Originated as \"period\" in the early 1900s, spread in the 2010s via the City Girls rap duo and Black Twitter, and entered into the mainstream by 2019. The addition of the T stems from a common trend in Black English where T is used as a replacement for D.",
    "pick-me": "Someone who seeks validation by trying to stand out, often putting down others in their gender or group to gain favor or attention.",
    "pookie": "An endearing nickname for a close friend or lover. Originates from a German term of endearment in the 1900s. Also used as a pet name.",
    "pushing P": "A phrase meaning acting with integrity and style while maintaining and displaying one’s success. The P in the phrase is most often interpreted as standing for the slang word \"player\". Originated from a trap track by the rappers Gunna, Future and Young Thug.",
    "queen": "A person (usually female) deemed impressive or praiseworthy. Originates from the noun term \"queen\" which is used to describe a person of high importance and royalty, in this case, someone who did something of importance that \"slayed\".",
    "ratio": "When a post, particularly on Twitter, receives more replies than retweets and likes combined. It can also been used for when a reply has better reception and more likes than the original post being replied to. Originates from the mathematical term \"ratio\" which compares the quantitative relationship between a set of numbers.",
    "rage-bait": "To elicit rage within an individual or group. Usually for an increase in web traffic, or personal enjoyment. See rage-baiting.",
    "red flag": "A warning sign indicating behaviors or characteristics within a relationship that may potentially be harmful or toxic. Oppositely, a green flag indicates positive aspects or healthy behaviors. The use of the term red flag as a warning traces back to the 18th century. Historically, red flags were used as signals during wars or battles to indicate danger. The term green flag comes from the use of green-colored flags indicating permission to proceed. The concept of 'beige flags' has gained popularity to represent behaviors that are neither positive nor negative, but rather depend on individual preferences or boundaries.",
    "rizz (/rɪz/)": "One's charm/seduction skills. Derived from charisma.",
    "Roman Empire": "A random event, person, incident, or thing that fascinates or intrigues one to the point that one is frequently thinking about it. Originated in 2023 after influencer Saskia Cort encouraged her Instagram followers to ask their male partners how often they thought about the Roman Empire, to which many answered quite often. The term spread internationally and evolved to mean something that frequently occupies one's thoughts. It has also morphed into a joke about how often people think about/mention the Roman Empire.",
    "salty": "Used to describe someone who is behaving or expressing themselves in a resentful, bitter, or irritated manner. Originally referred to \"racy\" or \"vulgar\" sailors in the 1800s.",
    "SDIYBT": "Acronym for \"Start digging in your butt, twin\".",
    "sheesh (/ʃiːʃ/)": "To praise someone when they are doing something good. The vowels are often emphasized, as in \"sheeesh\". The one being praised is to do the \"ice in my veins\" pose popularized by Basketball player D'Angelo Russell. Believed to be a variation of another word such as \"jeez\", \"Jesus\", or \"shit\". First used in 1955 as a word to express \"disappointment, annoyance or surprise\".",
    "shook": "To be shocked, surprised, or bothered. Became prominent in hip-hop starting in the 1990s, when it began to be used as a standalone adjective for uncontrollable emotions. One famous example is Mobb Deep's 1995 single \"Shook Ones, Part II\". See also shooketh.",
    "sigma/sigma male": "A person that is individualistic, self-reliant, successful, and is non-conforming to existing social norms. Used predominantly by the manosphere. Can also mean something that is good.",
    "simp (/sɪmp/)": "Sycophancy, being overly affectionate in pursuit of a sexual relationship.",
    "situationship": "Refers to an ambiguous romantic relationship in which both parties have feelings for one another, but said feelings are not clearly defined: a mid-point between dating and not dating.",
    "six-seven (6-7)": "A phrase referring to the numbers six and seven, often used as a response in any context, especially when the numbers \"six-seven\" or \"67\" are mentioned. Originated from the song Doot Doot (6 7) by Skrilla.",
    "skill issue": "Refers to a situation where a person's lack of ability or proficiency is seen as the cause of their failure or difficulty in completing a task.",
    "sksksk ": "Used to convey happiness/laughter. A form of keysmashing. The earliest known usage is by Brazilian users on Twitter. Used by various British, African-American, and gay communities before becoming associated with stan Twitter in 2019. Became associated with VSCO girls. Similar forms can be found regionally, like the Indonesian \"Wkwkwk\" or the Korean \"kkkk\".",
    "slaps": "Used to refer to something that is perceived to be good, particularly used when referring to music.",
    "slay": "To do something well.",
    "snatched": "Amazing, attractive, or flawlessly styled. Sometimes used to particularly describe a person as having a narrow waist.",
    "stan": "Supporting something to an extreme degree. Specifically used in cases of overzealous or obsessive support of celebrities, originating with the eponymous song by Eminem.",
    "sus": "Short term for suspect/suspicious. Popularized in 2018 by players of the online video game Among Us and received mainstream usage with the game's explosion in popularity in mid-2020 amidst the COVID-19 pandemic. According to Merriam-Webster, the term has been in use among English speakers since at least the 1960s.",
    "sussy baka": "A combination of \"sus\" and \"baka\", the Japanese word for \"fool\". Stemmed from TikToker Akeam Francis.",
    "sybau": "Acronym for \"shut your bitch ass up\".",
    "tea": "Secret information or rumors. Originates from Black drag culture of the 1990s. The letter \"t\" stood for \"truth\". \"Spilling the tea\" means to share gossip or rumors.",
    "touch grass": "A way of telling someone to \"go outside\", usually after said person is believed to have been online for too long. Believed to have originated in 2015, before experiencing a resurgence in 2020–2021.",
    "TS": "An abbreviation for \"this shit\", or just \"this\". Often used alongside pmo and icl.",
    "tweaking": "To be acting strangely or thinking that someone is hallucinating.",
    "unalive": "A euphemism for the word \"kill\" or other death-related terms, often in the context of suicide. This word is often used to circumvent social media algorithms, especially YouTube and TikTok, from censoring or demonetizing content that involves death-related terms.",
    "unc": "Abbreviation of uncle. Used in a mocking manner to refer to someone who is old or acting old. Originated in African American English in the early 2000s.",
    "understood the assignment": "To understand what was supposed to be done; to do something well. Popularized by American rapper Tay Money's 2021 song \"The Assignment\". She posted a video on TikTok stating that she \"understood the assignment\".",
    "uwu (/ˈuːwuː/)": "Used to portray happiness or one wanting to appear cute. Used more or less as an expression. Became popular in the 2000s. The expression is commonly associated with e-girls, furries, femboys, and anime fandoms.",
    "vibe check": "To check one's personality or attitude.",
    "VSCO girl": "A stereotypical white girl who often takes trendy and \"basic\" pictures of herself to later edit and post online. Named after VSCO, a photography app released in 2011. The term originated in 2018 and was popularized in 2019 on social media platforms such as TikTok, where it became a trendy Internet aesthetic. It fell out of popularity in late 2019.",
    "W": "Short for \"win,\" used to indicate success, victory, or something positive. Often contrasted with \"L\" (loss).",
    "who is this diva?": "An affectionate rhetorical question used to compliment people who positively embody diva-like qualities such as boldness, style, and/or confidence. Sometimes used with a purple heart emoji at the end. Originated from TikTok.",
    "yap": "To talk too much, especially without significant meaning. Speculated to be used as early as 1592 to express annoyance and irritation. Became a TikTok trend in 2023 for someone who talks too much or whose talking does not make sense.",
    "yeet (/jiːt/)": "To throw something with force and without regard. Also used as a generic positive exclamation.",
    "zesty": "Flamboyant, effeminate, or otherwise using the stereotypical mannerisms of a gay man."
}